<a href="https://colab.research.google.com/github/mkjubran/IntroToPython-NonIT/blob/main/StatisticsforDataScience.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Statistics for Data Science
By the end of this tutorial, you will be able to:

-       Compute statistical parameters for specific data

# Pandas DataFrames

Pandas is a high-level data manipulation tool. Its key data structure is called the DataFrame. DataFrames allow you to store and manipulate tabular data in rows of observations and collumns of variables.

Let us start this tutorial by importing the pandas library.

In [4]:
## importing the pandas library
import pandas as pd

We also need to clone some files to be used in the tutorial.

In [223]:
!rm -rf ./MachineLearning
!git clone https://github.com/mkjubran/MachineLearning.git

Cloning into 'MachineLearning'...
remote: Enumerating objects: 15, done.
remote: Counting objects: 100% (15/15), done.
remote: Compressing objects: 100% (13/13), done.
remote: Total 265 (delta 5), reused 12 (delta 2), pack-reused 250
Receiving objects: 100% (265/265), 72.83 MiB | 28.38 MiB/s, done.
Resolving deltas: 100% (120/120), done.

# Descriptive Statistics

**Mean**: The mean value is the average value. Pandas dataframe.mean() function return the mean of the values for the requested axis.

**Median**: Pandas dataframe.median() function return the median of the values for the requested axis

**Mode**: The mode of a set of values is the value that appears most often. It can be multiple values. The Dataframe.mode() function is used to get the mode(s) of each element along the selected axis. It can be multiple values.

In the previous tutorial we read the "carprices.csv" file that was cloned using the commands in section "Pandas DataFrames". This "cars.csv" file is stored and can be read using pd.read_csv.

In [179]:
# Import the cars.csv data: cars
cars = pd.read_csv("./MachineLearning/1_Regression/carprices.csv",index_col=0)

# Print out cars
cars

                       Mileage  Sell Price($)  Age(yrs)
Car Model
BMW X5                   69000          18000         6
BMW X5                   35000          34000         3
BMW X5                   57000          26100         5
BMW X5                   22500          40000         2
BMW X5                   46000          31500         4
Audi A5                  59000          29400         5
Audi A5                  52000          32000         5
Audi A5                  72000          19300         6
Audi A5                  91000          12000         8
Mercedez Benz C class    67000          22000         6
Mercedez Benz C class    83000          20000         7
Mercedez Benz C class    79000          21000         7
Mercedez Benz C class    59000          33000         5

Notice that the **Car Model** is the index collumn

Let us try to get some statistics about the DataFrame. For this we will use the DataFrame.describe() function

In [290]:
cars.describe()

            Mileage  Sell Price($)   Age(yrs)
count     12.000000      11.000000  13.000000
mean   61625.000000   25118.181818   5.307692
std    19843.850662    7403.758259   1.652504
min    22500.000000   12000.000000   2.000000
25%    54250.000000   19650.000000   5.000000
50%    63000.000000   26100.000000   5.000000
75%    73750.000000   31750.000000   6.000000
max    91000.000000   34000.000000   8.000000

For the rest of this tutorial, we will do examples on the DataFrame.mean() function. However, the same can be applied to the median, mode, min, max, count, and standard deviation. At the end you will be asked to do excercises on the median and mode.

Let us try to apply the dataframe.mean() to the entire cars DataFrame.

In [190]:
cars.mean()

Mileage          60884.615385
Sell Price($)    26023.076923
Age(yrs)             5.307692
dtype: float64

Use the dataframe.mean() to compute the average **Sell Price($)** of the cars.

In [191]:
#print(cars['Sell Price($)'])
cars['Sell Price($)'].mean()

26023.076923076922

Let us also try to compute the average of the **Age(yrs)** in the cars DataFrame

In [192]:
#print(cars['Age(yrs)'])
cars['Age(yrs)'].mean()

5.3076923076923075

##Filter Data while 'Car Model' is an Index Collumn

Let us try to apply the DataFrame.mean to Audi A5 cars only.

In [193]:
#print(cars.loc[['Audi A5']])
cars.loc[['Audi A5']].mean()

Mileage          68500.0
Sell Price($)    23175.0
Age(yrs)             6.0
dtype: float64

Let us compute the mean of the **Sell Price($)** of the **Audi A5** cars.

In [194]:
#print(cars.loc[['Audi A5']]['Sell Price($)'])
cars.loc[['Audi A5']]['Sell Price($)'].mean()

23175.0

To determine the total price of **Audi A5** cars

In [195]:
#print(cars.loc[['Audi A5']]['Sell Price($)'])
cars.loc[['Audi A5']]['Sell Price($)'].sum()

92700

To Determine the number of **Audi A5** cars

In [196]:
#print(cars.loc[['Audi A5']]['Sell Price($)'])
len(cars.loc[['Audi A5']]['Sell Price($)'])

4

Try to compute the mean by dividing the total price by the number of **Audi A5** cars. Is this value equal to the mean computed above?

In [197]:
#print(cars.loc[['Audi A5']]['Sell Price($)'])
cars.loc[['Audi A5']]['Sell Price($)'].sum()/len(cars.loc[['Audi A5']]['Sell Price($)'])

23175.0

Let us compute the mean of the **Sell Price($)** of the **Audi A5** and **BMW X5** cars.

In [198]:
#print(cars.loc[['Audi A5','BMW X5']]['Sell Price($)'])
cars.loc[['Audi A5','BMW X5']]['Sell Price($)'].mean()

26922.222222222223

Let us also try to use the DataFrame.groupby to get the Average **Sell Price($)** of **Audi A5** cars

In [199]:
cars_grouped = cars.groupby('Car Model')
#print(cars_grouped.get_group('Audi A5'))
#print(cars_grouped.get_group('Audi A5')['Sell Price($)'])
cars_grouped.get_group('Audi A5')['Sell Price($)'].mean()

23175.0

Let us try to get the Average **Sell Price($)** of all cars with **Age(yrs)** less than 6 years

In [200]:
#print(cars.loc[cars['Age(yrs)']<6])
cars.loc[cars['Age(yrs)']<6]['Sell Price($)'].mean()

32285.714285714286

Now, let us try to get the Average **Sell Price($)** of all cars with **Age(yrs)** less than 6 years using the DataFrame.where() method

In [201]:
filter = cars['Age(yrs)']<6
#print(cars.where(filter))
cars.where(filter)['Sell Price($)'].mean()

32285.714285714286

Now, let us try to get the Average **Sell Price($)** of all cars with **Age(yrs)** less than 6 years and **Mileage** less than 55000

In [202]:
filter1 = cars['Age(yrs)']<6
filter2 = cars['Mileage'] < 55000
#print(cars.where(filter1))
#print(cars.where(filter2))
#print(cars.where(filter1 & filter2))
cars.where(filter1 & filter2)['Sell Price($)'].mean()

34375.0

Now, let us try to get the Average **Sell Price($)** of **Audi A5** cars with **Age(yrs)** less than 6 years

In [203]:
## This code will not work because the "Car Model" is an index collumn
CarsAudiA5 = cars.loc[['Audi A5']]
#print(CarsAudiA5)
filter1 = CarsAudiA5['Age(yrs)']<6
#print(CarsAudiA5.where(filter1))
CarsAudiA5.where(filter1)['Sell Price($)'].mean()

30700.0

**This code will not work because the "Car Model" is an index collumn**

In [204]:
## This code will not work because the "Car Model" is an index collumn
filter1 = cars['Car Model'] == 'Audi A5'
filter2 = cars['Age(yrs)']<6
print(cars.where(filter1 & filter2))
cars.where(filter1 & filter2)['Sell Price($)'].mean()

KeyError: ignored

##Filter Data without 'Car Model' as an Index Collumn

Let us read the **cars.csv** wihtout specifying the index collumn

In [206]:
# Import the cars.csv data: cars
cars = pd.read_csv("./MachineLearning/1_Regression/carprices.csv")

# Print out cars
cars

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

Let us try to apply the DataFrame.mean to **Audi A5** cars only. In here, **Car Model** is an an index collumn

In [211]:
#print(cars[['Audi A5']]) ## will give an error because 'Car Model' is not an index collumn

filter=cars['Car Model']=='Audi A5'
#print(cars[filter]) ## will work similar to the filter data method in the previous examples 
cars[filter].mean()

Mileage          68500.0
Sell Price($)    23175.0
Age(yrs)             6.0
dtype: float64

We could get the mean of **Sell Price($)** of Cars

In [212]:
filter=cars['Car Model']=='Audi A5'
#print(cars[filter]['Sell Price($)']) ## will work similar to the filter data method in the previous examples 
cars[filter]['Sell Price($)'].mean()

23175.0

Now, let us try to get the Average **Sell Price($)** of **Audi A5** cars with **Age(yrs)** less than 6 years. For the following code to work, the **Car Model** should not be an index collumn.

In [213]:
filter1 = cars['Car Model'] == 'Audi A5'
filter2 = cars['Age(yrs)']<6
#print(cars.where(filter1 & filter2))
cars.where(filter1 & filter2)['Sell Price($)'].mean()

30700.0

## Check for NaN in Pandas DataFrame and replace it with the mean

A car prices database is stored in a .csv file in "./MachineLearning/1_Regression/carprices_missing.csv" file. This file contains some missing information. Let us first read and display the data in the .csv file. \\

In [246]:
# Import the cars.csv data: cars
carsM = pd.read_csv("./MachineLearning/1_Regression/carprices_missing.csv")

# Print out cars
carsM

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
3                  BMW X5  22500.0            NaN         2
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
6                 Audi A5      NaN        32000.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
9   Mercedez Benz C class  67000.0            NaN         6
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5

To check if the DataFrame contains any NaN

In [247]:
carsM.isnull().values.any()

True

Now, to check if **Car Model** has any NaN

In [248]:
carsM['Car Model'].isnull().values.any()

False

Let us check which of the other collumns has NaN values

In [251]:
print(carsM['Mileage'].isnull().values.any())
print(carsM['Sell Price($)'].isnull().values.any())
print(carsM['Age(yrs)'].isnull().values.any())

True
True
False

Instead of checking every collumn, we will use the isnull.sum() method to determine the number of 'NaN' in each collumn.

In [253]:
carsM.isnull().sum()

Car Model        0
Mileage          1
Sell Price($)    2
Age(yrs)         0
dtype: int64

### Droping rows with 'NaN' values

To remove the 'NaN', you could drop the corresponding rows

In [279]:
print(carsM) 
print('-------------------------------------------------------------------')
carsC=carsM.dropna()
print(carsC)
print('-------------------------------------------------------------------')
carsC=carsC.reset_index(drop=True)
print(carsC)

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
3                  BMW X5  22500.0            NaN         2
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
6                 Audi A5      NaN        32000.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
9   Mercedez Benz C class  67000.0            NaN         6
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5
-------------------------------------------------------------------
                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5
-------------------------------------------------------------------
               Car Model  Mileage  Sell Price($)  Age(yrs)
0                 BMW X5  69000.0        18000.0         6
1                 BMW X5  35000.0        34000.0         3
2                 BMW X5  57000.0        26100.0         5
3                 BMW X5  46000.0        31500.0         4
4                Audi A5  59000.0        29400.0         5
5                Audi A5  72000.0        19300.0         6
6                Audi A5  91000.0        12000.0         8
7  Mercedez Benz C class  83000.0        20000.0         7
8  Mercedez Benz C class  79000.0        21000.0         7
9  Mercedez Benz C class  59000.0        33000.0         5

### Filling NaN with Zeros

In [285]:
# Import the cars.csv data: cars
carsM = pd.read_csv("./MachineLearning/1_Regression/carprices_missing.csv")

# Print out cars
print(carsM)
print('-------------------------------------------------------------------')


carsM= carsM.fillna(0)
print(carsM)

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
3                  BMW X5  22500.0            NaN         2
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
6                 Audi A5      NaN        32000.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
9   Mercedez Benz C class  67000.0            NaN         6
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5
-------------------------------------------------------------------
                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
3                  BMW X5  22500.0            0.0         2
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
6                 Audi A5      0.0        32000.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
9   Mercedez Benz C class  67000.0            0.0         6
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5

### Filling NaN with the Mean

In the following code, we will fill the NaN in the **Sell Price(\$)** with the mean of the **Sell Price($)** collumn.

In [288]:
# Import the cars.csv data: cars
carsM = pd.read_csv("./MachineLearning/1_Regression/carprices_missing.csv")

# Print out cars
print(carsM)
print('-------------------------------------------------------------------')

m=cars['Mileage'].mean()
carsM['Mileage'] = carsM['Mileage'].fillna(m)
print(carsM)
print(m)

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
3                  BMW X5  22500.0            NaN         2
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
6                 Audi A5      NaN        32000.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
9   Mercedez Benz C class  67000.0            NaN         6
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5
-------------------------------------------------------------------
                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
3                  BMW X5  22500.0            NaN         2
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
6                 Audi A5  61625.0        32000.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
9   Mercedez Benz C class  67000.0            NaN         6
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5
61625.0

We will do the same for the **Age(yrs)** collumn

In [289]:
# Print out cars
print(carsM)
print('-------------------------------------------------------------------')

m=cars['Sell Price($)'].mean()
carsM['Sell Price($)'] = carsM['Sell Price($)'].fillna(m)
print(carsM)
print(m)

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0        18000.0         6
1                  BMW X5  35000.0        34000.0         3
2                  BMW X5  57000.0        26100.0         5
3                  BMW X5  22500.0            NaN         2
4                  BMW X5  46000.0        31500.0         4
5                 Audi A5  59000.0        29400.0         5
6                 Audi A5  61625.0        32000.0         5
7                 Audi A5  72000.0        19300.0         6
8                 Audi A5  91000.0        12000.0         8
9   Mercedez Benz C class  67000.0            NaN         6
10  Mercedez Benz C class  83000.0        20000.0         7
11  Mercedez Benz C class  79000.0        21000.0         7
12  Mercedez Benz C class  59000.0        33000.0         5
-------------------------------------------------------------------
                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5  69000.0   18000.000000         6
1                  BMW X5  35000.0   34000.000000         3
2                  BMW X5  57000.0   26100.000000         5
3                  BMW X5  22500.0   25118.181818         2
4                  BMW X5  46000.0   31500.000000         4
5                 Audi A5  59000.0   29400.000000         5
6                 Audi A5  61625.0   32000.000000         5
7                 Audi A5  72000.0   19300.000000         6
8                 Audi A5  91000.0   12000.000000         8
9   Mercedez Benz C class  67000.0   25118.181818         6
10  Mercedez Benz C class  83000.0   20000.000000         7
11  Mercedez Benz C class  79000.0   21000.000000         7
12  Mercedez Benz C class  59000.0   33000.000000         5
25118.18181818182

##Exercise 3.1: 
A Retail Data Customer Summary database is downloaded from Kaglle.com (https://www.kaggle.com/funxexcel/retail-data-customer-summary-learn-pandas-basics). The database is stored in the "./MachineLearning/1_Regression/1_Sales.csv" file. Write a pythone code to read the .csv file. Then use the data in this file to determine the following \\

In [233]:
##Read the .csv file here

1- The average Sales of Amy \\

In [234]:
## Write your code here

2- The total Sales of Amy \\

In [235]:
## Write your code here

3- The average units sold by Amy \\

In [236]:
## Write your code here

4- The total units sold by Amy \\

In [237]:
## Write your code here

5- The average Sales of Amy and Bob \\

In [238]:
## Write your code here

6- The total Sales of Amy and Bob \\

In [239]:
## Write your code here

7- The average units sold by Amy and Bob \\

In [240]:
## Write your code here

8- The total units sold by Amy and Bob \\

In [241]:
## Write your code here

9- The Total items sold by all sales representatives in Jan \\

In [242]:
## Write your code here

10- The Total items sold by all sales representatives in Jan and Feb

In [243]:
## Write your code here

11-Replace 'NaN' with the mean values of the corresponding collumn.

In [244]:
## Write your code here

##Exercise 3.2:
For the car prices database with missing information used in previous examples (stored in a .csv file in "./MachineLearning/1_Regression/carprices_missing.csv"). Try to replace the 'NAN' for each of the following cases:

1- By using the mean of the same car models.

In [ ]:
##Read the .csv file here

2- By using the mean of the cars that has the same Age(yrs) value

In [ ]:
##Read the .csv file here

3- By using the mean of the cars that has Mileage value withing 10% of its mileage value. This is for NaN not in the 'Mileage' collumn.

In [ ]:
##Read the .csv file here

##Exercise 3.3
Repeat the examples in this tutorial using the Median.

##Exercise 3.4
Repeat the examples in this tutorial using the mode.

##Exercise 3.5
Redo Excercise 3.1 using the median.

##Exercise 3.6
Redo Excercise 3.1 using the mode.

##Exercise 3.7
Redo Excercise 3.2 using the median.

##Exercise 3.8
Redo Excercise 3.2 using the mode.

# References

The material of this notebook excluding the exercises are selected from \\
[1] w3schools : https://www.w3schools.com/python/python_ml_mean_median_mode.asp \\
[2] DataFish : https://datatofish.com/replace-nan-values-with-zeros/\\
[3] geeks for geeks : https://www.geeksforgeeks.org/python-pandas-dataframe-mean/#:~:text=mean()%20function%20return%20the,the%20observations%20in%20the%20dataframe.